openthread/openthread/examples/platforms/efr32/efr32mg1/radio.c
    if (status == RAIL_STATUS_NO_ERROR)
    {
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        sRailDebugCounters.mRailTxStarted++;
#endif
        otPlatRadioTxStarted(aInstance, aFrame);
    }
    else
    {
#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
        sRailDebugCounters.mRailTxStartFailed++;
#endif
        // Tx started at an invalid time or an invalid paramter has been passed.
        sTransmitError = OT_ERROR_CHANNEL_ACCESS_FAILURE;
        sTransmitBusy  = false;
        otSysEventSignalPending();
    }

exit:
    return error;
}

otRadioFrame *otPlatRadioGetTransmitBuffer(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return &sTransmitFrame;
}

int8_t otPlatRadioGetRssi(otInstance *aInstance)
{
    otError  error;
    uint32_t start;
    int8_t   rssi = OT_RADIO_RSSI_INVALID;

    OT_UNUSED_VARIABLE(aInstance);

    error = efr32StartEnergyScan(ENERGY_SCAN_MODE_SYNC, sReceiveFrame.mChannel, EFR32_RSSI_AVERAGING_TIME);
    otEXPECT(error == OT_ERROR_NONE);

    start = RAIL_GetTime();

    // waiting for the event RAIL_EVENT_RSSI_AVERAGE_DONE
    while (sEnergyScanStatus == ENERGY_SCAN_STATUS_IN_PROGRESS &&
           ((RAIL_GetTime() - start) < EFR32_RSSI_AVERAGING_TIMEOUT))
        ;

    if (sEnergyScanStatus == ENERGY_SCAN_STATUS_COMPLETED)
    {
        rssi = sEnergyScanResultDbm;
    }

    sEnergyScanStatus = ENERGY_SCAN_STATUS_IDLE;
exit:
    return rssi;
}

otRadioCaps otPlatRadioGetCaps(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return OT_RADIO_CAPS_ACK_TIMEOUT | OT_RADIO_CAPS_CSMA_BACKOFF | OT_RADIO_CAPS_ENERGY_SCAN;
}

bool otPlatRadioGetPromiscuous(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return sPromiscuous;
}

void otPlatRadioSetPromiscuous(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    RAIL_Status_t status;

    sPromiscuous = aEnable;

    status = RAIL_IEEE802154_SetPromiscuousMode(gRailHandle, aEnable);
    assert(status == RAIL_STATUS_NO_ERROR);
}

void otPlatRadioEnableSrcMatch(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    // set Frame Pending bit for all outgoing ACKs if aEnable is false
    sIsSrcMatchEnabled = aEnable;
}

static bool sAckedWithFPFifoIsFull(void)
{
    return (uint32_t)(sAckedWithFPWriteIndex - sAckedWithFPReadIndex) == otARRAY_LENGTH(sAckedWithFPFifo);
}

static bool sAckedWithFPFifoIsEmpty(void)
{
    return (uint32_t)(sAckedWithFPWriteIndex - sAckedWithFPReadIndex) == 0;
}

static efr32AckedWithFP *sAckedWithFPFifoGetWriteSlot(void)
{
    uint32_t idx = sAckedWithFPWriteIndex & (otARRAY_LENGTH(sAckedWithFPFifo) - 1);
    return &sAckedWithFPFifo[idx];
}

static const efr32AckedWithFP *sAckedWithFPFifoGetReadSlot(void)
{
    uint32_t idx = sAckedWithFPReadIndex & (otARRAY_LENGTH(sAckedWithFPFifo) - 1);
    return &sAckedWithFPFifo[idx];
}

static void insertIeee802154DataRequestCommand(RAIL_Handle_t aRailHandle)
{
    assert(!sAckedWithFPFifoIsFull());
    efr32AckedWithFP *const slot = sAckedWithFPFifoGetWriteSlot();

    RAIL_RxPacketInfo_t packetInfo;

    RAIL_GetRxIncomingPacketInfo(aRailHandle, &packetInfo);
    assert(packetInfo.packetBytes >= 4); // PHR + FCF + DSN

    if (packetInfo.packetBytes > sizeof(slot->mPacket))
    {
        packetInfo.packetBytes = sizeof(slot->mPacket);
        if (packetInfo.firstPortionBytes >= sizeof(slot->mPacket))
        {
            packetInfo.firstPortionBytes = sizeof(slot->mPacket);
            packetInfo.lastPortionData   = NULL;
        }
    }
    slot->mLength = packetInfo.packetBytes;
    RAIL_CopyRxPacket(slot->mPacket, &packetInfo);

    ++sAckedWithFPWriteIndex;
}

static bool wasAckedWithFramePending(const uint8_t *aPsdu, uint8_t aPsduLength)
{
    bool     ackedWithFramePending = false;
    uint16_t fcf                   = aPsdu[IEEE802154_FCF_OFFSET] | (aPsdu[IEEE802154_FCF_OFFSET + 1] << 8);

    otEXPECT((fcf & IEEE802154_FRAME_TYPE_MASK) == IEEE802154_FRAME_TYPE_MAC_COMMAND);

    while (!(ackedWithFramePending || sAckedWithFPFifoIsEmpty()))
    {
        const efr32AckedWithFP *const slot = sAckedWithFPFifoGetReadSlot();
        if ((slot->mPacket[0] == aPsduLength) && (memcmp(slot->mPacket + 1, aPsdu, slot->mLength - 1) == 0))
        {
            ackedWithFramePending = true;
        }
        ++sAckedWithFPReadIndex;
    }

exit:
    return ackedWithFramePending;
}

static void processNextRxPacket(otInstance *aInstance)
{
    RAIL_RxPacketHandle_t  packetHandle = RAIL_RX_PACKET_HANDLE_INVALID;
    RAIL_RxPacketInfo_t    packetInfo;
    RAIL_RxPacketDetails_t packetDetails;
    RAIL_Status_t          status;
    uint16_t               length;
    bool                   framePending = false;

    packetHandle = RAIL_GetRxPacketInfo(gRailHandle, RAIL_RX_PACKET_HANDLE_OLDEST, &packetInfo);

    otEXPECT_ACTION(packetHandle != RAIL_RX_PACKET_HANDLE_INVALID &&
                        packetInfo.packetStatus == RAIL_RX_PACKET_READY_SUCCESS,
                    packetHandle = RAIL_RX_PACKET_HANDLE_INVALID);

    status = RAIL_GetRxPacketDetailsAlt(gRailHandle, packetHandle, &packetDetails);
    otEXPECT(status == RAIL_STATUS_NO_ERROR);

    length = packetInfo.packetBytes + 1;

    // check the length in recv packet info structure; RAIL should take care of this.
    assert(length == packetInfo.firstPortionData[0]);

    // check the length validity of recv packet; RAIL should take care of this.
    assert(length >= IEEE802154_MIN_LENGTH && length <= IEEE802154_MAX_LENGTH);

    otLogInfoPlat("Received data:%d", length);

    // skip length byte
    assert(packetInfo.firstPortionBytes > 0);
    packetInfo.firstPortionData++;
    packetInfo.firstPortionBytes--;
    packetInfo.packetBytes--;

    // read packet
    RAIL_CopyRxPacket(sReceiveFrame.mPsdu, &packetInfo);

    status = RAIL_ReleaseRxPacket(gRailHandle, packetHandle);
    if (status == RAIL_STATUS_NO_ERROR)
    {
        packetHandle = RAIL_RX_PACKET_HANDLE_INVALID;
    }

    sReceiveFrame.mLength = length;

    if (packetDetails.isAck)
    {
        assert((length == IEEE802154_ACK_LENGTH) &&
               (sReceiveFrame.mPsdu[0] & IEEE802154_FRAME_TYPE_MASK) == IEEE802154_FRAME_TYPE_ACK);

        RAIL_YieldRadio(gRailHandle);
        sTransmitBusy = false;

        if (sReceiveFrame.mPsdu[IEEE802154_DSN_OFFSET] == sTransmitFrame.mPsdu[IEEE802154_DSN_OFFSET])
        {
            sTransmitError = OT_ERROR_NONE;
        }
        else
        {
            sTransmitError = OT_ERROR_NO_ACK;
        }
    }
    else
    {
        // signal MAC layer for each received frame if promiscuous is enabled
        // otherwise only signal MAC layer for non-ACK frame
        otEXPECT(sPromiscuous || (length != IEEE802154_ACK_LENGTH));

        sReceiveError = OT_ERROR_NONE;

        sReceiveFrame.mInfo.mRxInfo.mRssi = packetDetails.rssi;
        sReceiveFrame.mInfo.mRxInfo.mLqi  = packetDetails.lqi;

        // Get the timestamp when the SFD was received
        assert(packetDetails.timeReceived.timePosition != RAIL_PACKET_TIME_INVALID);
        packetDetails.timeReceived.totalPacketBytes = length + 1;

        status = RAIL_GetRxTimeSyncWordEndAlt(gRailHandle, &packetDetails);
        assert(status == RAIL_STATUS_NO_ERROR);
        sReceiveFrame.mInfo.mRxInfo.mTimestamp = packetDetails.timeReceived.packetTime;

        // Set this flag only when the packet is really acknowledged with frame pending set.
        framePending = wasAckedWithFramePending(sReceiveFrame.mPsdu, sReceiveFrame.mLength);
        sReceiveFrame.mInfo.mRxInfo.mAckedWithFramePending = framePending;

#if OPENTHREAD_CONFIG_DIAG_ENABLE

